emacs/.emacs.d/init.el
;; Avoid blinding white at startup
(load-theme 'wombat)

(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room

(menu-bar-mode -1)            ; Disable the menu bar

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type 'relative)

(global-display-line-numbers-mode 1)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; Replace yes no answers by y or n
(defalias 'yes-or-no-p 'y-or-n-p)

;; Let emacs use system clipboard as a default behaviour
(setq x-select-enable-clipboard t)
(setq interprogram-paste-function 'x-cut-buffer-or-selection-value)

(defun fonts/set-size (font-size)
  (set-face-attribute 'default nil :font "Fira Code" :height font-size)
  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height font-size)
  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height font-size :weight 'regular))

(defun fonts/default-size ()
  (interactive)
  (fonts/set-size 85))

(defun fonts/big-size ()
  (interactive)
  (fonts/set-size 140))

(fonts/default-size)

(setq ibuffer-formats
      '((mark modified read-only locked " "
              (icon 2 2 :left :elide)
              #(" " 0 1
                (display
                 (space :align-to 8)))
              (name 50 50 :left :elide)
              " "
              (size 9 -1 :right)
              " "
              (mode 16 16 :left :elide)
              " "
              (vc-status 12 :left)
              " " filename-and-process)
        (mark " "
              (name 16 -1)
              " " filename)))

(defun ibuffer-custom-filter-groups ()
  (append
   '(
     ("Applications" (and
                      (mode . exwm-mode)
                      (not (name . "qutebrowser:.*"))
                      (not (name . "Firefox:.*"))))
     ("Qutebrowser" (name . "qutebrowser:.*"))
     ("Firefox" (name . "Firefox:.*")))
    (ibuffer-projectile-generate-filter-groups)
  )
 )

(add-hook 'ibuffer-mode-hook
          (lambda ()
            (setq ibuffer-saved-filter-groups
             (list
              (append
               '("custom")
               (ibuffer-custom-filter-groups))))
               (ibuffer-switch-to-saved-filter-groups "custom")
            (ibuffer-auto-mode 1)))

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(setq straight-use-package-by-default t)

(use-package general
  :config
  (general-create-definer keys/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "s-d")

  (keys/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")))

(use-package undo-tree
  :config
  (global-undo-tree-mode 1))

(use-package evil

  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)
  (evil-set-undo-system 'undo-tree))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package treemacs-evil)

(use-package evil-multiedit
 :config
 (evil-multiedit-default-keybinds))

(use-package evil-surround
  :config
  (global-evil-surround-mode 1))

(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(keys/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(use-package all-the-icons)
(use-package all-the-icons-dired

  :config
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
(use-package all-the-icons-ibuffer)

(use-package ibuffer-vc)

(use-package doom-themes

  :init (load-theme 'doom-dark+ t)
  :config
  (setq doom-themes-treemacs-theme "doom-colors"))

(use-package doom-modeline

  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 22)))

(use-package rainbow-delimiters

  :hook (prog-mode . rainbow-delimiters-mode))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

(use-package helpful

  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package ace-window

  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (setq aw-background nil)
  (setq aw-dispatch-always t)
  (ace-window-display-mode t)
  (keys/leader-keys
    "o" #'ace-window
    "O" #'ace-swap-window)
  )

(use-package ace-jump-mode)
