emacs/README.org
** Treemacs
#+begin_src emacs-lisp

  (defun efs/treemacs-set-fringe ()
    (setq left-fringe-width 0)
    (setq right-fringe-width 0))

  (use-package treemacs

    :config
    (add-hook 'treemacs-mode-hook #'efs/treemacs-set-fringe))

  (use-package treemacs-all-the-icons

    :config
    (treemacs-load-theme "all-the-icons"))

  (efs/treemacs-set-fringe)
 
#+end_src

** Yascroll
#+begin_src emacs-lisp

  (use-package yascroll

    :config
    (global-yascroll-bar-mode 1)
    (setq yascroll:delay-to-hide nil)
    ;; Don't hide scrollbar when editing
    (defadvice yascroll:before-change (around always-show-bar activate) ()))

#+end_src

** Volatile highlights
#+begin_src emacs-lisp

  (use-package volatile-highlights)

#+end_src

** Highlight parentheses
#+begin_src emacs-lisp

  (use-package highlight-parentheses
    :config
    (global-highlight-parentheses-mode 1))

#+end_src

** Highlight parentheses
#+begin_src emacs-lisp

  (use-package focus)

#+end_src

* Search packages  
** Counsel
#+begin_src emacs-lisp

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (keys/leader-keys
      "y" #'counsel-yank-pop))

#+end_src

** Ivy
#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1)
    (setq ivy-initial-inputs-alist nil))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

#+end_src

** Ivy posframe
#+begin_src emacs-lisp

  (use-package ivy-posframe
    :after ivy
    :custom-face
    (ivy-posframe-border ((t (:background "#632174"))))
    :custom
    (ivy-posframe-border-width 1)
    (ivy-posframe-width 170)
    (ivy-posframe-min-width 170)
    :config
    (ivy-posframe-mode 1))

#+end_src

** Wgrep
#+begin_src emacs-lisp

  (use-package wgrep
    :config
    (setq wgrep-auto-save-buffer t))

#+end_src

** Company
#+begin_src emacs-lisp

  (use-package company
    :bind (:map company-active-map
                ("<tab>" . company-select-next)
                ("<backtab>" . company-select-previous))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.2)
    :config
    (global-company-mode 1))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** Orderless
#+begin_src emacs-lisp

  (use-package orderless
    :config
    (setq ivy-re-builders-alist '((t . orderless-ivy-re-builder))))

#+end_src

** Amx
#+begin_src emacs-lisp

  (use-package amx)

#+end_src

** Avy
#+begin_src emacs-lisp

  (use-package avy
    :config
    (keys/leader-keys
      "f" '(avy-goto-word-0 :which-key "Go to word")))

#+end_src

* File explorer
** Ranger
Provide a better way of moving arround than plain dired. Files are previewed in emacs, and folder are previewed in a dired buffer.

#+begin_src emacs-lisp

  (use-package image-dired)

  (use-package ranger)

#+end_src

* Org mode
