emacs/.emacs.d/init.el

(defun efs/treemacs-set-fringe ()
  (setq left-fringe-width 0)
  (setq right-fringe-width 0))

(use-package treemacs

  :config
  (add-hook 'treemacs-mode-hook #'efs/treemacs-set-fringe))

(use-package treemacs-all-the-icons

  :config
  (treemacs-load-theme "all-the-icons"))

(efs/treemacs-set-fringe)

(use-package yascroll

  :config
  (global-yascroll-bar-mode 1)
  (setq yascroll:delay-to-hide nil)
  ;; Don't hide scrollbar when editing
  (defadvice yascroll:before-change (around always-show-bar activate) ()))

(use-package volatile-highlights)

(use-package highlight-parentheses
  :config
  (global-highlight-parentheses-mode 1))

(use-package focus)

(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :config
  (keys/leader-keys
    "y" #'counsel-yank-pop))

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1)
  (setq ivy-initial-inputs-alist nil))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package wgrep
  :config
  (setq wgrep-auto-save-buffer t))

(use-package company
  :bind (:map company-active-map
              ("<tab>" . company-select-next)
              ("<backtab>" . company-select-previous))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.2)
  :config
  (global-company-mode 1))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package orderless
  :config
  (setq ivy-re-builders-alist '((t . orderless-ivy-re-builder))))

(use-package avy
  :config
  (keys/leader-keys
    "f" '(avy-goto-word-0 :which-key "Go to word")))

(use-package image-dired)

(use-package ranger)
