emacs/.emacs.d/init.el

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Projects/Code")
    (setq projectile-project-search-path '("~/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))

(use-package ibuffer-projectile)

(use-package flycheck)

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  :config
  (keys/leader-keys
    "gg" '(magit :which-key "magit status")))

;; (use-package forge)

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package dap-mode)

(use-package highlight-indent-guides
  :custom
  (highlight-indent-guides-method 'character)
  (highlight-indent-guides-responsive 'top))

(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)

(use-package rainbow-mode
  :straight (rainbow-mode :type git :host github :repo "emacsmirror/rainbow-mode"))

(defun efs/lsp-mode-setup ()
   (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
   (lsp-headerline-breadcrumb-mode)
   (let ((lsp-keymap-prefix "C-SPC"))
   (lsp-enable-which-key-integration)))

 (use-package lsp-mode
   :init
   (setq lsp-keymap-prefix "C-SPC")  ;; Or 'C-l', 's-l'
   :commands (lsp lsp-deferred)
   :hook (lsp-mode . efs/lsp-mode-setup)
   :config
   (define-key lsp-mode-map (kbd "C-SPC") lsp-command-map)
   (define-key lsp-mode-map (kbd "s-l") nil))

(add-hook 'lsp-mode-hook 'highlight-indent-guides-mode)

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-doc-position 'at-point))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy)

(use-package typescript-mode
  :mode ("\\.ts\\'")
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2)
  (require 'dap-node)
  (dap-node-setup))

(defun efs/js-mode-setup ()
  (lsp-deferred)
  (require 'dap-node)
  (dap-node-setup))

(add-hook 'js-mode-hook 'efs/js-mode-setup)

(add-hook 'sh-mode-hook 'lsp-deferred)

(use-package yaml-mode
   :straight (yaml-mode :type git :host github :repo "yoshiki/yaml-mode")
   :config
   (add-hook 'yaml-mode-hook 'highlight-indent-guides-mode))

(use-package json-mode
  :config
  (add-hook 'json-mode-hook 'highlight-indent-guides-mode))

(use-package restclient
  :straight (restclient :type git :host github :repo "pashky/restclient.el")
  :hook (restclient-mode . company-mode))

(add-to-list 'auto-mode-alist '("\\.http\\'" . restclient-mode))

(use-package company-restclient)

(add-to-list 'company-backends 'company-restclient)

(use-package adoc-mode
  :hook (adoc-mode . company-mode))

(add-to-list 'auto-mode-alist '("\\.adoc\\'" . adoc-mode))

(use-package dockerfile-mode)

(use-package docker-compose-mode)

(use-package docker
:config
(defun docker/set-format ()
  (interactive)
  (setq tabulated-list-format [("Names" 30 t)("Ports" 30 t)("Status" 20 t)("Id" 16 t)("Image" 15 t)("Command" 30 t)("Created" 23 t)])
  (setq tabulated-list-padding 2)
  (setq tabulated-list-sort-key docker-container-default-sort-key)
  (add-hook 'tabulated-list-revert-hook 'docker-container-refresh nil t)
  (tabulated-list-init-header)
  (tablist-minor-mode))

(defun docker-container-parse (line)
  "Convert a LINE from \"docker container ls\" to a `tabulated-list-entries' entry."
  (condition-case nil
      (let* ((data (json-read-from-string line))
             (uptime (aref data 6))
             (status (aref data 2)))
        (aset data 6 (format-time-string "%F %T" (date-to-time uptime)))
        (aset data 2 (propertize status 'font-lock-face (docker-container-status-face status)))
        (list (aref data 1) data))
    (json-readtable-error
     (error "Could not read following string as json:\n%s" line))))

(defun docker-container-entries ()
  "Return the docker containers data for `tabulated-list-entries'."
  (let* ((fmt "[{{json .Names}},{{json .Ports}},{{json .Status}},{{json .ID}},{{json .Image}},{{json .Command}},{{json .CreatedAt}}]")
         (data (docker-run-docker "container ls" (docker-container-ls-arguments) (format "--format=\"%s\"" fmt)))
         (lines (s-split "\n" data t)))
    (-map #'docker-container-parse lines)))

(defun docker-container-refresh ()
  "Refresh the containers list."
  (setq tabulated-list-entries (docker-container-entries)))

(define-derived-mode docker-container-mode tabulated-list-mode "Containers Menu"
  "Major mode for handling a list of docker containers."
  (setq tabulated-list-format [("Names" 30 t)("Ports" 40 t)("Status" 20 t)("Id" 16 t)("Image" 15 t)("Command" 30 t)("Created" 23 t)])
  (setq tabulated-list-padding 2)
  (setq tabulated-list-sort-key docker-container-default-sort-key)
  (add-hook 'tabulated-list-revert-hook 'docker-container-refresh nil t)
  (tabulated-list-init-header)
  (tablist-minor-mode))

(defun docker/dcup (string-services)
 (interactive "sDocker services to start: ")
 (setq docker-services (split-string string-services))
 (cl-loop for service in docker-services
 collect (docker-compose-run-docker-compose-async "up" service)))

  (setq docker-container-shell-file-name "/bin/sh")

  (add-hook 'docker-container-mode 'docker/set-format)

  (keys/leader-keys
    "d"  'docker
    "D"  'docker-compose))

(use-package kubernetes)

(use-package kubernetes-evil
  :after kubernetes)

(use-package vterm
  :config
  (setq vterm-shell "/bin/zsh")
  (setq vterm-buffer-name-string "vterm: %s"))

(use-package term
  :config
  (setq explicit-shell-file-name "zsh")

  ;; Use 'explicit-<shell>-args for shell-specific args
  ;;(setq explicit-zsh-args '())         

  (setq evil-move-cursor-back t)

  ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))
