emacs/README.org
** Windmove
#+begin_src emacs-lisp

  (use-package windmove)

  ;; (use-package framemove
  ;;   :straight (framemove :type git :host github :repo "emacsmirror/framemove")
  ;;   :config
  ;;   (setq framemove-hook-into-windmove t))

#+end_src

** Windsize
#+begin_src emacs-lisp

  (use-package windsize)

#+end_src

** Zoom
#+begin_src emacs-lisp

  (use-package zoom
    :config
    (setq zoom-size '(0.618 . 0.618)))

#+end_src

* End of the wrap
#+begin_src emacs-lisp

  )
  (setq gc-cons-threshold (* 100 1024 1024))
  (provide 'init)

#+end_src
