emacs/.emacs.d/init.el

(use-package windmove)

;; (use-package framemove
;;   :straight (framemove :type git :host github :repo "emacsmirror/framemove")
;;   :config
;;   (setq framemove-hook-into-windmove t))

(use-package windsize)

(use-package zoom
  :config
  (setq zoom-size '(0.618 . 0.618)))
